
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаРоли				= Справочники.ИдентификаторыОбъектовМетаданных.НайтиПоНаименованию("Роли", Истина, Справочники.ИдентификаторыОбъектовМетаданных.ПустаяСсылка());
	ГруппаРолиРасширений	= Справочники.ИдентификаторыОбъектовРасширений.НайтиПоНаименованию("Роли", Истина, Справочники.ИдентификаторыОбъектовРасширений.ПустаяСсылка());
	
	Список.Параметры.УстановитьЗначениеПараметра("Роли",			ГруппаРоли);
	Список.Параметры.УстановитьЗначениеПараметра("РолиРасширений",	ГруппаРолиРасширений);
		
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Закрыть(Значение);
	
КонецПроцедуры // СписокВыборЗначения()
